app/Filament/Resources/UserResource.php

select count(*) as aggregate from `posts` where `posts`.`user_id` = 1 and `posts`.`user_id` is not null
---
    public static function table(Table $table): Table
    {
        return $table
            ->columns([
                ImageColumn::make('avatar')
                    ->circular(),
                TextColumn::make('name'),
                TextColumn::make('email'),
                TextColumn::make('post_count')
                    ->state(fn ($record) => $record->posts()->count()),